CSI API ETABS v1
cDesignShearWall.GetRebar Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebar(
	ref string[] AreaObjName,
	ref string[] StoryName,
	ref string[] PierLabel,
	ref string[] StationLocation,
	ref string[] LegID,
	ref double[] LeftX1,
	ref double[] LeftY1,
	ref double[] RightX2,
	ref double[] RightY2,
	ref double[] Length,
	ref double[] Thickness,
	ref double[] fc,
	ref double[] fy,
	ref double[] fys,
	ref string[] Flexural,
	ref string[] ShearAndConfinement
)
Function GetRebar (
	ByRef AreaObjName As String(),
	ByRef StoryName As String(),
	ByRef PierLabel As String(),
	ByRef StationLocation As String(),
	ByRef LegID As String(),
	ByRef LeftX1 As Double(),
	ByRef LeftY1 As Double(),
	ByRef RightX2 As Double(),
	ByRef RightY2 As Double(),
	ByRef Length As Double(),
	ByRef Thickness As Double(),
	ByRef fc As Double(),
	ByRef fy As Double(),
	ByRef fys As Double(),
	ByRef Flexural As String(),
	ByRef ShearAndConfinement As String()
) As Integer
Dim instance As cDesignShearWall
Dim AreaObjName As String()
Dim StoryName As String()
Dim PierLabel As String()
Dim StationLocation As String()
Dim LegID As String()
Dim LeftX1 As Double()
Dim LeftY1 As Double()
Dim RightX2 As Double()
Dim RightY2 As Double()
Dim Length As Double()
Dim Thickness As Double()
Dim fc As Double()
Dim fy As Double()
Dim fys As Double()
Dim Flexural As String()
Dim ShearAndConfinement As String()
Dim returnValue As Integer
returnValue = instance.GetRebar(AreaObjName,
	StoryName, PierLabel, StationLocation,
	LegID, LeftX1, LeftY1, RightX2, RightY2,
	Length, Thickness, fc, fy, fys, Flexural,
	ShearAndConfinement)
int GetRebar(
	array<String^>^% AreaObjName,
	array<String^>^% StoryName,
	array<String^>^% PierLabel,
	array<String^>^% StationLocation,
	array<String^>^% LegID,
	array<double>^% LeftX1,
	array<double>^% LeftY1,
	array<double>^% RightX2,
	array<double>^% RightY2,
	array<double>^% Length,
	array<double>^% Thickness,
	array<double>^% fc,
	array<double>^% fy,
	array<double>^% fys,
	array<String^>^% Flexural,
	array<String^>^% ShearAndConfinement
)
abstract GetRebar :
        AreaObjName : string[] byref *
        StoryName : string[] byref *
        PierLabel : string[] byref *
        StationLocation : string[] byref *
        LegID : string[] byref *
        LeftX1 : float[] byref *
        LeftY1 : float[] byref *
        RightX2 : float[] byref *
        RightY2 : float[] byref *
        Length : float[] byref *
        Thickness : float[] byref *
        fc : float[] byref *
        fy : float[] byref *
        fys : float[] byref *
        Flexural : string[] byref *
        ShearAndConfinement : string[] byref -> int
Parameters
AreaObjName
Type: System.String[]
StoryName
Type: System.String[]
PierLabel
Type: System.String[]
StationLocation
Type: System.String[]
LegID
Type: System.String[]
LeftX1
Type: System.Double[]
LeftY1
Type: System.Double[]
RightX2
Type: System.Double[]
RightY2
Type: System.Double[]
Length
Type: System.Double[]
Thickness
Type: System.Double[]
fc
Type: System.Double[]
fy
Type: System.Double[]
fys
Type: System.Double[]
Flexural
Type: System.String[]
ShearAndConfinement
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignShearWall Interface
ETABSv1 Namespace